{
  "main": {
    "name": "Ryan Kirsch",
    "occupation": "Web & Mobile Developer. AWS Certified Cloud Practitioner. IT Project Manager.",
    "description": "Learner, Problem Solver, Engineer",
    "image": "profilepic.jpg",
    "bio": "Hi there! I'm Ryan! I’m a full stack software engineer with experience building modern CRM & eCommerce solutions. I thrive in challenging environments where I can continue to grow in my learning leveraging modern technologies. With my experience in both sales and IT project management, I lead cross-functional teams by fostering creative and diverse ideas that optimize systems and workflows. I’m always focused on orchestrating better customer experience through better understanding of end-user experience. Most recently I completed Backend Python Web Development, PostgreSQL with Python, and DevOps with Python Certificate through Nucamp Coding Bootcamp to gain new skills. Right now, I’m enjoying challenging myself in the third cohort of Plutus Pioneers, which will allow me to further and hone my blockchain development skills. Follow me to see my progress! I aim to leverage my attention to detail, ability to calculate risk, and analytical skills to drive better decision making across the business. Always open to professional collaboration and networking. Let’s connect!",
    "contactmessage": "Get in touch with me about job opportunities!",
    "email": "ryankirsch88@gmail.com",
    "phone": "+1-301-233-4363",
    "address": {
      "street": "123 Dev Lane",
      "city": "Charlotte",
      "state": "NC",
      "zip": "28273"
    },
    "website": "",
    "resumedownload": "https://drive.google.com/file/d/1wAYrFclJziJBikL8YlKyuktVH0jdPOTQ/view?usp=sharing",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/ryan-s-kirsch/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "instagram",
        "url": "https://www.instagram.com/agalloch88/",
        "className": "fa fa-instagram"
      },
      {
        "name": "github",
        "url": "https://github.com/agalloch88",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "My Programming Language Proficiency",
    "education": [
      {
        "school": "IOHK",
        "degree": "Plutus Pioneers Third Cohort",
        "graduated": "In Progress - Expected March 2022",
        "description": "Learn how to develop with Plutus for use on Cardano blockchain."
      },
      {
        "school": "Nucamp Coding Bootcamp",
        "degree": "Full Stack (MERN) Web & Mobile Development - Graduate with Honors",
        "graduated": "May 2021",
        "description": "Completed all coursework and multiple personal portfolio projects to earn Honors distinction."
      },
      {
        "school": "Nucamp Coding Bootcamp",
        "degree": "Backend Python Web Development, PostgreSQL with Python, and DevOps with Python - Graduate",
        "graduated": "December 2021",
        "description": "Completed all coursework and multiple personal portfolio projects to graduate from program in first cohort."
      },
      {
        "school": "University of Wisconsin-Madison",
        "degree": "Bachelor of Arts",
        "graduated": "May 2011",
        "description": "Degree in Public Relations. Completed Bachelor's Degree in three years."
      }
    ],
    "work": [
      {
        "company": "Longevity Consulting",
        "title": "Software Engineer",
        "years": "August 2021 - Present",
        "description": "Architected full stack GRC platform with React and Django for use with dozens of partner government agencies, complete with GraphQL schema. Developed and implemented RPA solutions using UiPath Studio for internal use cases, and worked with partner agencies to identify and automate tasks saving an average of $3,000+ per employee per year. Assisted US Dept. of Education in maintaining and expanding their program offerings to at-risk youth via Drupal 7 to Drupal 9 migration, AWS/GovCloud infrastructure compliance, and general site overhaul."
      },
      {
        "company": "Loxe Inc.",
        "title": "Software Engineer",
        "years": "July 2021 - Present",
        "description": "Built a decentralized mediation platform on the Cardano blockchain to advance the future of mediation access and transparency. Developed front end React assets using Tailwind CSS, and GraphQL schema components to facilitate the ease of signing up as a mediator or mediation party, selecting dates, paying for services and receiving funds. Collaborated with a globally disparate, multicultural team to build initial MVP, pitched to multiple different panels with Cardano Project Catalyst for seed funding."
      },
      {
        "company": "Asset Strategies International",
        "title": "IT Project Manager",
        "years": "September 2011 - July 2021",
        "description": "Designed and built secure, scalable, lightweight services, features, and applications for the web using C# and SQL - including some light front-end work. Worked with business and development team to ideate, iterate, and prototype new capabilities for system platform. Orchestrated key architectural decisions on CRM and eCommerce integration solution that focused on customer-centric experience. Researched, coordinated, and managed database migration from a proprietary system to HubSpot CRM, Shopify platform, coupled with proprietary business workflow component for seamless data sync. Formulated new system testing, implementation, and training plans. Presented weekly cross-team project updates to stakeholders and led collaboration between teams to keep project on target and on budget. Promoted from Assistant Sales Manager, executing 50% YOY growth in core investment programs, critical to the company’s bear market profitability. Supervised, trained, and motivated Sales Representatives for success within the company and beyond. Achieved top sales figures since 2014, averaging over $350,000 gross profit per year while working 100% remote."
      }
    ],
    "skills": [
      {
        "name": "ReactJS",
        "level": "75%"
      },
      {
        "name": "Python",
        "level": "65%"
      },
      {
        "name": "GraphQL",
        "level": "60%"
      },
      {
        "name": "AWS",
        "level": "75%"
      },
      {
        "name": "Git/Github",
        "level": "80%"
      },
      {
        "name": "JavaScript",
        "level": "75%"
      },
      {
        "name": "Docker",
        "level": "65%"
      },
      {
        "name": "Web Development",
        "level": "80%"
      },
      {
        "name": "React Native",
        "level": "65%"
      },
      {
        "name": "NodeJS",
        "level": "70%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Discord Clone (React JS)",
        "category": "",
        "image": "discord.jpg",
        "url": "https://metalbrewz-chat-v2.web.app/"
      },
      {
        "title": "Twitter Clone (Next JS)",
        "category": "",
        "image": "twitter.jpg",
        "url": "https://twitter-v2-phi.vercel.app/"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Ryan stood out to me as a very sharp student from very early on in the course. He has shown multiple great engineering qualities. He is one of the few who always engage and participate during class discussion and always eager to learn. I highly recommend him for any junior Web Development position or junior Software Engineer position. I believe that he would be a great asset to any company.",
        "user": "Phudith Pattharakositkul"
      },
      {
        "text": "I had an opportunity to teach Ryan bootstrap, through his Nucamp journey, and coach him through his career. He is a fast learner and understands technology and concepts quickly.He helped struggling students with troubleshooting and debugging code when he was done with his assignments. He is a team player, critical thinker and ambitious. He would be a great asset to any company.",
        "user": "Ghani Zahid MBA, MPM"
      },
      {
        "text": "Ryan was definitely a 'go-to person' for me. When something important needed done he was definitely someone I could count on. He cares about his work, supports the people he works with, and delivers to his clients. I am really excited about his new venture, and look forward to hearing of his success. If I could work with him again, I would in a second.",
        "user": "Steve Emerick"
      }
    ]
  }
}
